   // Модальные окна
   const heroes = [
    {
        title: "Полиция",
        image: "../modal-police.jpg",
        description: "Полиция как герои нашего времени — это концепция, которая может быть обобщена через несколько ключевых аспектов: Защита и безопасность: Полиция играет важную роль в обеспечении общественного порядка и безопасности граждан. Они реагируют на преступления, предотвращают правонарушения и помогают в экстренных ситуациях. Служение обществу: Многие полицейские воспринимают свою работу как призвание. Они стремятся помогать людям, решать конфликты и поддерживать мир в сообществах. Риск и жертва: Полиция часто рискует своей жизнью, чтобы защитить других. Это делает их действия героическими, особенно в условиях опасности. Этика и ответственность: Важно, чтобы полиция действовала в рамках закона и соблюдала этические нормы. Герои должны быть не только сильными, но и справедливыми. Общественное восприятие: Восприятие полиции как героев может меняться в зависимости от культурного контекста, исторического фона и личного опыта людей. В некоторых сообществах полиция может восприниматься как защитники, в других — как источник страха. Реформа и развитие: Современные вызовы требуют от полиции адаптации и реформирования. Полицейские силы должны работать над улучшением доверия и взаимодействия с населением."
        
    },
    {
        title: "Пожарные",
        image: "../modal-fire.jpg",
        description: "Пожарные — это настоящие герои нашего времени, которые ежедневно рискуют своими жизнями ради спасения других. Их работа требует не только физической силы и выносливости, но и высокой степени профессионализма, смелости и готовности к экстренным ситуациям. Основные аспекты работы пожарных: Спасение жизней: Пожарные первыми прибывают на место происшествия, чтобы эвакуировать людей из опасных ситуаций, будь то пожар, наводнение или другие чрезвычайные происшествия. Профилактика: Они не только тушат пожары, но и занимаются профилактической работой, обучая население правилам безопасности и предотвращения пожаров. Командная работа: Пожарные работают в командах, где каждый член команды играет важную роль. Эффективное взаимодействие и доверие между коллегами критически важны для успешного выполнения задач. Физическая подготовка: Пожарные проходят строгую физическую подготовку и обучение, чтобы быть готовыми к любым вызовам, с которыми они могут столкнуться. Эмоциональная устойчивость: Работа пожарного часто связана с высоким уровнем стресса и эмоциональными нагрузками. Пожарные должны уметь справляться с травмирующими ситуациями и поддерживать друг друга. Технологическое оснащение: Современные пожарные используют высокотехнологичное оборудование и защитные средства, что позволяет им более эффективно справляться с опасными ситуациями. Герои в повседневной жизни Пожарные не только борются с огнем, но и выступают в роли героев в повседневной жизни, помогая людям в различных чрезвычайных ситуациях. Их самоотверженность и служение обществу делают их настоящими примерами мужества и благородства."
    },
    {
        title: "Медицинская служба",
        image: "../modal-medic.jpg",
        description: "Медики действительно являются героями нашего времени, играя ключевую роль в поддержании здоровья и благополучия общества. Их работа требует не только профессиональных знаний и навыков, но и высокой степени самоотверженности, сострадания и эмоциональной устойчивости. Основные аспекты работы медиков: Спасение жизней: Врачи, медсестры и другие медицинские работники ежедневно сталкиваются с экстренными ситуациями, где их вмешательство может спасти жизнь пациента. Профилактика заболеваний: Медики активно занимаются профилактикой, обучая население о важности здорового образа жизни, вакцинации и регулярных медицинских обследованиях. Эмоциональная поддержка: Медицинские работники не только лечат физические недуги, но и оказывают психологическую поддержку пациентам и их семьям в трудные времена. Командная работа: В больницах и клиниках медики работают в командах, где важно взаимодействие и сотрудничество для достижения наилучших результатов лечения. Стрессоустойчивость: Работа в здравоохранении часто связана с высоким уровнем стресса, особенно в условиях пандемий или массовых чрезвычайных ситуаций. Медики должны уметь справляться с эмоциональными нагрузками. Постоянное обучение: Медицина — это постоянно развивающаяся область, и медики обязаны постоянно обновлять свои знания, осваивать новые технологии и методы лечения. Герои в повседневной жизни Медики выступают настоящими героями не только в экстренных ситуациях, но и в повседневной практике, обеспечивая качественное медицинское обслуживание и заботясь о здоровье населения. Их самоотверженность и преданность делу делают их примером для подражания."
    },
    {
        title: "Военные",
        image: "../modal-military.jpg",
        description: "Военные герои нашего времени представляют собой людей, которые служат своим странам, защищая их интересы, безопасность и свободу. Их роль в современном обществе многогранна и включает в себя не только боевые действия, но и гуманитарные миссии, миротворчество и поддержку гражданского населения в кризисных ситуациях. Основные аспекты военной службы: Защита страны: Военные служат на передовой, защищая свои государства от внешних угроз и обеспечивая безопасность граждан. Самоотверженность: Многие военнослужащие рискуют своей жизнью, выполняя опасные задания. Их готовность к самопожертвованию вдохновляет и вызывает уважение. Гуманитарные миссии: Военные часто участвуют в гуманитарных операциях, помогая пострадавшим от конфликтов или природных катастроф, обеспечивая медицинскую помощь и восстановление инфраструктуры. Миротворчество: В рамках международных миссий военные помогают поддерживать мир и стабильность в регионах, охваченных конфликтами, содействуя процессам примирения. Лидерство и командная работа: Военные учатся работать в команде, развивают лидерские качества и принимают важные решения в условиях стресса. Поддержка ветеранов: Многие военные продолжают служить обществу после выхода на пенсию, участвуя в программах поддержки ветеранов и их семей. Современные вызовы Современные военные герои сталкиваются с новыми вызовами, такими как киберугрозы, терроризм и нестабильные политические ситуации. Они должны быть готовы адаптироваться к быстро меняющимся условиям и использовать новые технологии в своей работе."
    },
    {
        title: "Другие герои",
        image: "../modal-people.jpg",
        description: "В нашем мире существует множество людей, которые ежедневно совершают великие дела, часто оставаясь незамеченными, но внося значительный вклад в жизнь общества. Эти люди — настоящие герои, которые работают на благо других, преодолевая трудности и проявляя самоотверженность. Давайте подробнее рассмотрим некоторые из категорий таких выдающихся личностей и их важную роль в жизни общества. Волонтеры — это люди, которые безвозмездно отдают своё время и силы, чтобы помочь другим. Они работают в различных сферах: от помощи бездомным и малоимущим до участия в экологических акциях и поддержке животных. Волонтерство — это не просто работа; это призвание. Эти люди объединяются ради общей цели, стремясь сделать мир лучше. Их самоотверженность и доброта вдохновляют окружающих и создают атмосферу взаимопомощи и поддержки в обществе. Волонтеры часто становятся связующим звеном между различными группами людей, помогая им объединиться ради достижения общих целей. Учителя играют ключевую роль в формировании будущего общества. Они не только передают знания, но и воспитывают моральные и этические ценности у своих учеников. Учитель — это не просто профессия; это призвание, требующее терпения, любви к детям и желания делиться своими знаниями. Хороший учитель способен вдохновить своих учеников на достижения, поддерживать их в трудные времена и помогать развивать их таланты. В условиях быстро меняющегося мира учителя также играют важную роль в подготовке молодежи к будущим вызовам, обучая их критическому мышлению и навыкам решения проблем. Творческие личности — художники, писатели, музыканты — также вносят важный вклад в общество. Их искусство может служить источником вдохновения, поднимать актуальные социальные темы и помогать людям справляться с трудностями. Через свои произведения они могут затрагивать глубокие человеческие эмоции и побуждать к размышлениям о жизни, любви, справедливости и других важных вопросах. Искусство имеет уникальную способность объединять людей, помогая им находить общий язык и понимание друг друга."
       }
];

function openModal(index) {
    const hero = heroes[index];
    document.getElementById("modal-title").innerText = hero.title;
    document.getElementById("modal-image").src = hero.image;
    document.getElementById("modal-description").innerText = hero.description;
    document.getElementById("myModal").style.display = "block";
    document.getElementById("modal-image").style.display = "flex";
    document.getElementById("modal-image").style.width = "100%";
}

function closeModal() {
    document.getElementById("myModal").style.display = "none";
}

// Слайдер
let currentSlideIndex = 0;

function showSlides() {
    const slides = document.querySelectorAll(".slider img");
    for (let i = 0; i < slides.length; i++) {
        slides[i].style.display = "none";
    }
    currentSlideIndex++;
    if (currentSlideIndex > slides.length) { currentSlideIndex = 1 }
    slides[currentSlideIndex - 1].style.display = "block";
    setTimeout(showSlides, 3000);
}

function moveSlide(n) {
    const slides = document.querySelectorAll(".slider img");
    currentSlideIndex += n;
    if (currentSlideIndex > slides.length) { currentSlideIndex = 1; }
    if (currentSlideIndex < 1) { currentSlideIndex = slides.length; }
    for (let i = 0; i < slides.length; i++) {
        slides[i].style.display = "none";
    }
    slides[currentSlideIndex - 1].style.display = "block";
}

window.onload = showSlides;

